# FormArray Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormArray Constructor
FormArray Class See Also
---
Initializes a new instance of the FormArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FormArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FormArray()
```

# See Also
FormArray Class
Autodesk.Revit.DB Namespace